app/views/listings/show.html.erb

SELECT  "categories".* FROM "categories" INNER JOIN "listing_categories" ON "categories"."id" = "listing_categories"."category_id" WHERE "listing_categories"."listing_id" = $1  ORDER BY "categories"."id" ASC LIMIT 1  [["listing_id", 1]]
---
 <section class="bottom">
   <h3><span class="glyphicon glyphicon-home" aria-hidden="true"></span><%= @listing.categories.first.name %></h3>