app/views/listings/show.html.erb

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."listing_id" = $1  ORDER BY "pictures"."id" ASC LIMIT 1  [["listing_id", 1]]
---
      <ol>
      <% @listing.pictures.each do |pic|%>