app/controllers/admin/items_controller.rb

  def update
    if @item.update(item_params)
---
UPDATE "items" SET "price" = $1, "avatar" = $2, "updated_at" = $3 WHERE "items"."id" = $4  [["price", "3.5"], ["avatar", nil], ["updated_at", "2015-03-31 19:33:34.840822"], ["id", 8]]

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO "items" ("name", "description", "price", "avatar", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Beer Toast"], ["description", "Soggy, beery toast"], ["price", "3.5"], ["avatar", nil], ["created_at", "2015-03-31 19:33:34.685095"], ["updated_at", "2015-03-31 19:33:34.685095"]]

  def destroy
    if @item.destroy
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 12]]