app/controllers/admin/item_categories_controller.rb

  def create
    @listing_category = ItemCategory.new(listing_category_params)
    category = Category.find(@listing_category.category_id)

    if @listing_category.save
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "item_categories" ("category_id", "item_id") VALUES ($1, $2) RETURNING "id"  [["category_id", 1], ["item_id", 1]]

  def destroy
    @listing.categories.delete(@category)
---
DELETE FROM "item_categories" WHERE "item_categories"."item_id" = $1 AND "item_categories"."category_id" = 1  [["item_id", 1]]

  def set_category
    @category = Category.find(params[:category_id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]

  def set_listing
    @listing = Item.find(params[:listing_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]