app/controllers/admin/orders_controller.rb

SELECT "orders".* FROM "orders"
---
  def index
    status = params[:status]
    #@orders = Order.sort_by_status(status)
    @orders = Order.all

UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", 2], ["updated_at", "2015-03-31 19:33:35.380198"], ["id", 21]]
---
  def update
    if @order.update(order_params)