app/controllers/cart_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    item_id = params[:item_id]
    @cart.add_item(item_id)
    session[:cart] = @cart.content
    item = Item.find(item_id)

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 14]]
---
  def destroy
    item_id = params[:format]
    @cart.remove_item(item_id)
    item = Item.find(item_id)