app/controllers/carts_controller.rb

  def create
    listing_id = params[:listing_id]
    @cart.add_listing(listing_id)
    session[:cart] = @cart.content
    listing = Listing.find(listing_id)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT 1  [["id", 4]]