app/controllers/carts_controller.rb

  def update
    listing_id = params[:id]
    start_date = params[:listing][:start_date]
    end_date = params[:listing][:end_date]
    @cart.add_listing(listing_id, [start_date, end_date])
    session[:cart] = @cart.content
    listing = Listing.find(listing_id)
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT 1  [["id", 2]]