app/controllers/hosts_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", nil]]
---
  def show
    @host = User.find(params[:id])