app/controllers/orders_controller.rb

  def index
    @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 32]]