app/controllers/travelers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 51]]
---
  def show
    if current_user != User.find(params[:id])