app/controllers/users/bookings_controller.rb

INSERT INTO "bookings" ("user_id", "cart", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    cart = @cart.content
    current_user.bookings.create(trip_name: params[:trip_name]).generate_reservations(cart)